#include <stdio.h>
int main()
{
	system ("chcp 1253");
	int a,b,c;
	printf("\n");
	printf("Εισάγετε την πρώτη τιμή. (1)\t>>> ");
	scanf("%i",&a);
	printf("Εισάγετε την Δεύτερη τιμή. (2)\t>>> ");
	scanf("%i",&b);
	printf("Εισάγετε την τελευταία τιμή. (3)  >>> ");
	scanf("%i",&c);
	printf("=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n");
	
	(a>b)?(a>c)?printf("Η Πρώτη (1) τιμή που δόθηκε (%d) είναι η μεγαλύτερη.",a):
	(a==c)?printf("Η μεγαλήτερη τιμή που δόθηκε είναι το (%d) και εισήχθη Πρώτη (1) και Τρίτη (3)",a):
	printf("Η Τρίτη (3) τιμή που δόθηκε (%d) είναι η μεγαλύτερη.",c):
	(a==b)?(a==c)?printf("Η μεγαλύτερη τιμή που δόθηκε είναι το: (%d) και εισήχθη Πρώτη (1), Δεύτερη (2) και Τρίτη (3).",a):
	(a>c)?printf("Η μεγαλύτερη τιμή είναι το: (%d) και εισήχθη Πρώτη (1) και Δεύτερη (2).",a):printf("Η μεγαλύτερη τιμή είναι το: (%d) και εισήχθη Τρίτη (3)",c):
	(b>c)?printf("Η μεγαλύτερη τιμή είναι το: (%d) και εισήχθη Δεύτερη (2).",b):
	(b==c)?printf("Η μεγαλύτερη τιμή είναι το: (%d) και εισήχθη Δεύτερη (2) και Τρίτη (3).",b):
	printf("Η μεγαλύτερη τιμή είναι το: (%d) και εισήχθη Τρίτη.",c);
	
	return 0;
}

