#include <stdio.h>
#include <math.h>
int main()
{	
	system ("chcp 1253");
	double a,b,c,x,x0,x1,x2,D;
	printf("Εισάγετε την τιμή α\t\n>>> ");
	scanf("%lf",&a);
	printf("Εισάγετε την Δέυτερη τιμή (β)\t\n>>> ");
	scanf("%lf",&b);
	printf("Εισάγετε την Τελευταία τιμή (γ)\t\n>>> ");
	scanf("%lf",&c);
	printf("α=  %.3lf\nβ=  %.3lf\nγ=  %.3lf\n\n",a,b,c);
	D=pow(b,2)-4*a*c;
	printf("=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n\n");
	
	if (a==0)
	{
		if (b==0)
			printf("Η συγκεκριμένη πρωτοβάθμια εξίσωση είναι αόριστη διότι οι τιμές (α,β) είναι ίσες με το 0\n");	
		else 
		{
			x= -c/b;
			printf("Η συγκεκριμένη πρωτοβάθμια εξίσωση έχει την ρίζα: %.3lf\n",x);
		}
	}
	else
	{
		printf("Διακρίνουσα =\t%.lf^2-4*%.lf*%.lf = %.3lf\n",b,a,c,D);
		if (D>=0)
			if (D==0)
			{
				printf("Η συγκεκριμένη Εξισωσή έχει μια διπλή λύση λογώ οτι η Διακρίνουσα (%.2lf) ειναι ίση με το 0\n");
				x0= -b/(2*a);
				printf("Η ρίζα αυτή την τιμή:  %.3lf\n",x0);
			}
			else
			{
				x1= -b+sqrt(D)/(2*a);
				x2= -b-sqrt(D)/(2*a);
				printf("Η συγκεκριμένη εξισωσή έχει δύο ρίζες λογώ οτι η Διακρίνουσα (%lf) είναι μεγαλύτερη απο το 0\n");
				printf("Οι δύο ρίζες έχουν τιμή:\tx1= %.3lf\tx2 %.3lf ",x1,x2);
			}
		else
			printf("Η εξίσωση είναι αδύνατη διότι η Διακρίνουσα (%.3lf) ειναι αρνητική (ή έχει 2 Μιγαδικές ρίζες.)\n",D);
	}
	return 0;
}

