#include <stdio.h>
#include <math.h>
int main()
{	
	system ("chcp 1253");
	double a,b,c,x0,x1,x2,D;
	printf("Εισάγετε την τιμή α (Εκτός απο 0 ή 1)\t\n>>> ");
	scanf("%lf",&a);
	while (a==0 || a==1)
	{
		printf("Παρακαλώ εισάγετε μια έγκυρη τιμή (α) (Εκτός απο 1 ή 0)\t\n>>> ");
		scanf("%lf",&a);
	}
	printf("Εισάγετε την Δέυτερη τιμή (β)\t\n>>> ");
	scanf("%lf",&b);
	printf("Εισάγετε την Τελευταία τιμή (γ)\t\n>>> ");
	scanf("%lf",&c);
	printf("α=  %lf\nβ=  %lf\nγ=  %lf\n\n",a,b,c);
	D=pow(b,2)-4*a*c;
	printf("Διακρίνουσα =%4.lf^2-4*%4.lf*%4.lf = %lf\n",b,a,c,D);
	printf("=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n\n");
	if (D>=0)
		if (D==0)
		{
			printf("Η συγκεκριμένη Εξισωσή έχει μια διπλή λογώ οτι η Διακρίνουσα (%.2lf) ειναι ίση με το 0\n");
			x0= -b/(2*a);
			printf("Η ρίζα αυτή την τιμή:  %lf\n",x0);
		}
		else
		{
			x1= -b+sqrt(D)/(2*a);
			x2= -b-sqrt(D)/(2*a);
			printf("Η συγκεκριμένη εξισωσή έχει δύο ρίζες λογώ οτι η Διακρίνουσα (%lf) είναι μεγαλύτερη απο το 0\n");
			printf("Οι δύο ρίζες έχουν τιμή:\tx1= %lf\tx2 %lf ",x1,x2);
		}
	
	else
		printf("Η εξίσωση είναι αδύνατη διότι η Διακρίνουσα (%lf) ειναι αρνητική\n",D);
	
	
	return 0;
}
